print('Задача 2. Финансовый отчёт')

# Васе пришло очередное задание — автоматизация финансовой отчётности. 
# Звучит сложно, а на деле нужно просто написать код, который будет считать нужные для отчёта вычисления автоматически. 
# Вычисления, которые нужно реализовать в программе: сумму дохода первых двух кварталов поделить на сумму последних двух кварталов, 
# чтобы понять динамику роста или падения дохода.

# Алгоритм действий в программе:
# 1) Запросить у пользователя четыре числа.
# 2) Отдельно сложить два первых и два вторых.
# 3) Разделить первую сумму на вторую.
# 4) Вывести результат на экран.

first_number = int(input("Введите первое число: "))
second_number = int(input("Введите второе число: "))
third_number = int(input("Введите третье число: "))
fourth_number = int(input("Введите четвертое число: "))

#Складываем два первых числа
sum_first_numbers = first_number + second_number
#Складываем два вторых числа
sum_second_numbers = third_number + fourth_number
#Деление первой суммы на вторую
dividing_amounts = sum_first_numbers / sum_second_numbers
#Вывод результата в консоль
print("Результат: ", dividing_amounts)
