print('Задача 7. Режем число на части')

# Реализуйте программу,
# которая получает на вход четырёхзначное число
# и выводит на экран каждую его цифру отдельно
# (в одну строчку либо каждая цифра в новой строчке).
# Само число при этом изменять нельзя, то есть нужно обойтись без переприсваивания.
# Однако можно использовать сколько угодно переменных

number = int(input("Введите четырёхзначное число: "))

a = number // 1000
b = number % 1000 // 100
c = number % 100 // 10
d = number % 10

print("Вывод цифр в одну строчку")
print(a, b, c, d)
print("Вывод каждой цифры в новой строчке")
#Т.к. в переменных цифры (int), а не строки(str), то все переменные переводим в строку и с помощью \n каждое число переносим на новую строку
print(a, "\n" + str(b), "\n" + str(c), "\n" + str(d))
